; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 - counter
	)
  (:init
		(= (value c0) 12)
	(= (value c1) 51)
	(= (value c2) 23)
	(= (value c3) 92)
	(= (value c4) 15)
	(= (value c5) 57)
	(= (value c6) 78)
	(= (value c7) 32)
	(= (value c8) 41)
	(= (value c9) 75)
	(= (value c10) 29)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
		)
	)
)

; plan
1. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 10
2. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 10
3. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 10
4. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 6 of 10
5. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 6 of 10
6. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 6 of 10
7. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 6 of 10
8. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 6 of 10
9. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 6 of 10
10. (increment c4)
   changed: (value c4) from 15 to 24
   goals met: 6 of 10
11. (increment c4)
   changed: (value c4) from 24 to 33
   goals met: 6 of 10
12. (increment c4)
   changed: (value c4) from 33 to 42
   goals met: 6 of 10
13. (increment c4)
   changed: (value c4) from 42 to 51
   goals met: 6 of 10
14. (increment c4)
   changed: (value c4) from 51 to 60
   goals met: 5 of 10
15. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 10
16. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 10
17. (increment c4)
   changed: (value c4) from 60 to 69
   goals met: 5 of 10
18. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 5 of 10
19. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 5 of 10
20. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 5 of 10
21. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 5 of 10
22. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 5 of 10
23. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 5 of 10
24. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 5 of 10
25. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 5 of 10
26. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 5 of 10
27. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 5 of 10
28. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 5 of 10
29. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 5 of 10
30. (increment c10)
   changed: (value c10) from 29 to 37
   goals met: 5 of 10
31. (increment c10)
   changed: (value c10) from 37 to 45
   goals met: 5 of 10
32. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 5 of 10
33. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 5 of 10
34. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 5 of 10
35. (increment c10)
   changed: (value c10) from 45 to 54
   goals met: 5 of 10
36. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 5 of 10
37. (increment c10)
   changed: (value c10) from 54 to 64
   goals met: 5 of 10
38. (increment c10)
   changed: (value c10) from 64 to 74
   goals met: 5 of 10
39. (increment c10)
   changed: (value c10) from 74 to 84
   goals met: 6 of 10
40. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 6 of 10
41. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 6 of 10
42. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 6 of 10
43. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 6 of 10
44. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 6 of 10
45. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 6 of 10
46. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 6 of 10
47. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 6 of 10
48. (increment c7)
   changed: (value c7) from 32 to 40
   goals met: 6 of 10
49. (increment c7)
   changed: (value c7) from 40 to 48
   goals met: 5 of 10
50. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 5 of 10
51. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 5 of 10
52. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 5 of 10
53. (increment c7)
   changed: (value c7) from 48 to 57
   goals met: 5 of 10
54. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 5 of 10
55. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 5 of 10
56. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 5 of 10
57. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 5 of 10
58. (increment c7)
   changed: (value c7) from 57 to 67
   goals met: 5 of 10
59. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 5 of 10
60. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 5 of 10
61. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 5 of 10
62. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 5 of 10
63. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 5 of 10
64. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 5 of 10
65. (increment c2)
   changed: (value c2) from 23 to 29
   goals met: 5 of 10
66. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 5 of 10
67. (increment c2)
   changed: (value c2) from 29 to 36
   goals met: 5 of 10
68. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 5 of 10
69. (increment c2)
   changed: (value c2) from 36 to 44
   goals met: 5 of 10
70. (increment c2)
   changed: (value c2) from 44 to 52
   goals met: 6 of 10
71. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 6 of 10
72. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 6 of 10
73. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 6 of 10
74. (increment c8)
   changed: (value c8) from 41 to 47
   goals met: 6 of 10
75. (increment c8)
   changed: (value c8) from 47 to 53
   goals met: 6 of 10
76. (increment c8)
   changed: (value c8) from 53 to 59
   goals met: 6 of 10
77. (increment c8)
   changed: (value c8) from 59 to 65
   goals met: 6 of 10
78. (increment c8)
   changed: (value c8) from 65 to 71
   goals met: 7 of 10
79. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 7 of 10
80. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 7 of 10
81. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 7 of 10
82. (decrement c3)
   changed: (value c3) from 92 to 87
   goals met: 7 of 10
83. (decrement c3)
   changed: (value c3) from 87 to 82
   goals met: 7 of 10
84. (decrement c3)
   changed: (value c3) from 82 to 77
   goals met: 7 of 10
85. (decrement c3)
   changed: (value c3) from 77 to 72
   goals met: 7 of 10
86. (decrement c3)
   changed: (value c3) from 72 to 67
   goals met: 8 of 10
87. (increment c5)
   changed: (value c5) from 57 to 60
   goals met: 8 of 10
88. (decrement c4)
   changed: (value c4) from 69 to 59
   goals met: 8 of 10
89. (decrement c3)
   changed: (value c3) from 67 to 62
   goals met: 8 of 10
90. (decrement c3)
   changed: (value c3) from 62 to 57
   goals met: 9 of 10
91. (decrement c6)
   changed: (value c6) from 78 to 76
   goals met: 9 of 10
92. (decrement c6)
   changed: (value c6) from 76 to 74
   goals met: 9 of 10
93. (decrement c6)
   changed: (value c6) from 74 to 72
   goals met: 9 of 10
94. (decrement c6)
   changed: (value c6) from 72 to 70
   goals met: 9 of 10
95. (decrement c6)
   changed: (value c6) from 70 to 68
   goals met: 9 of 10
96. (decrement c6)
   changed: (value c6) from 68 to 66
   goals met: 10 of 10
